# Estadistica Aplicada

Sesion 3 - 15 agosto 

Ana Sofia Saucedo Garcia 1946646

Grupo 042

## Tuplas 
 Es una coleccion de objetos inmutable ( no se puede cambiar )

In [2]:
tupla_alumno = ('Juan','Perez',17)

In [3]:
type(tupla_alumno)

tuple

In [4]:
tupla_alumno.remove('Juan')

AttributeError: 'tuple' object has no attribute 'remove'

## Diccionarios (mapeo de valores)

clave variable - valor

In [ ]:
dic1_alumno= {'Nombre': 'Juan','Apellido':'Perez'}

In [ ]:
type(dic1_alumno)

dict

In [ ]:
dic_grupo = {'Nombre':['Jime','Raul','Ana'],'Edad':[17,21,15]}

In [ ]:
dic_grupo['Nombre']

['Jime', 'Raul', 'Ana']

In [ ]:
dic_grupo.keys()

dict_keys(['Nombre', 'Edad'])

In [ ]:
dic_grupo.values()

dict_values([['Jime', 'Raul', 'Ana'], [17, 21, 15]])

## Pandas 

Pandas nos ayuda  manejar datos estructurados , construido sobre numpy , todo lo de numpy aplica en pandas.

Pandas tiene tres estructuras basicas : 
1. Series (unidimensionales)
2. Dataframes (filas y columnas)
3. Panel (tiempo)

In [14]:
import pandas as pd

Suponer que conocemos la edad de las siguientes personas : Pedro 12 , Juan 17 , Jime 21 , Rosa 22

In [15]:
edades = [12, 17,21,22]

In [16]:
serie_edades = pd.Series(edades, index=['Pedro','Juan','Jime','Rosa'])

In [17]:
serie_edades

Pedro    12
Juan     17
Jime     21
Rosa     22
dtype: int64

In [18]:
serie_edades.mean()

18.0

In [19]:
serie_edades.median()

19.0

## Data Frame

Datos en filas y columnas

In [20]:
alumno1 = ['Juan','Perez',23]
alumno2 = ['Raul','Gonzales',17]
alumno3 = ['Jimena','Rosas',20]
alumno4 = ['Alejandra','Saldaña',21]

In [21]:
grupo_Estadistica = [alumno1,alumno2,alumno3,alumno4]

In [22]:
grupo_Estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzales', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [23]:
df_clase= pd.DataFrame(grupo_Estadistica , columns = ["Nombre","Apellido","Edad"])

In [24]:
type(df_clase)

pandas.core.frame.DataFrame

In [25]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzales    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [26]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [27]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
df_clase['Municipio'] = ['Monterrey','Escobedo','Apodaca','Santiago']

In [29]:
df_clase

      Nombre  Apellido  Edad  Municipio
0       Juan     Perez    23  Monterrey
1       Raul  Gonzales    17   Escobedo
2     Jimena     Rosas    20    Apodaca
3  Alejandra   Saldaña    21   Santiago

In [30]:
df_clase['Edad en dias'] = df_clase['Edad']*365

In [31]:
df_clase

      Nombre  Apellido  Edad  Municipio  Edad en dias
0       Juan     Perez    23  Monterrey          8395
1       Raul  Gonzales    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

## Seleccionar elementos de un dataframe

1. Seleccion Estandar
2. Seleccion por .iloc
3. Seleccion por .loc
4. Seleccion condicional

### Seleccion estandar

In [32]:

df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [33]:

df_clase[['Edad','Nombre']]

   Edad     Nombre
0    23       Juan
1    17       Raul
2    20     Jimena
3    21  Alejandra

In [34]:
## Seleccion estandar filas 

df_clase[0:2]

  Nombre  Apellido  Edad  Municipio  Edad en dias
0   Juan     Perez    23  Monterrey          8395
1   Raul  Gonzales    17   Escobedo          6205

In [35]:
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

### Seleccion .iloc (posicion)

dataframe.iloc [filas,columnas]

In [36]:
df_clase.iloc[0,2]

23

In [37]:
df_clase.iloc[0:2,2]

0    23
1    17
Name: Edad, dtype: int64

In [38]:
df_clase.iloc[:,[1,2]]

   Apellido  Edad
0     Perez    23
1  Gonzales    17
2     Rosas    20
3   Saldaña    21

In [39]:
df_clase

      Nombre  Apellido  Edad  Municipio  Edad en dias
0       Juan     Perez    23  Monterrey          8395
1       Raul  Gonzales    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

In [40]:
df_clase=df_clase.set_index('Nombre')

In [41]:
df_clase

           Apellido  Edad  Municipio  Edad en dias
Nombre
Juan          Perez    23  Monterrey          8395
Raul       Gonzales    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [42]:
df_clase.columns

Index(['Apellido', 'Edad', 'Municipio', 'Edad en dias'], dtype='object')

In [43]:
df_clase.index

Index(['Juan', 'Raul', 'Jimena', 'Alejandra'], dtype='object', name='Nombre')

### Seleccion por .loc (etiquetas)
dataframe.loc [filas,columnas]

In [44]:
df_clase.loc[:,'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [45]:
df_clase.loc['Juan','Edad']

23

In [46]:
## Seleccion por SQL 
df_clase.Edad

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [47]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Municipio  Edad en dias
Nombre
Juan         Perez    23  Monterrey          8395
Jimena       Rosas    20    Apodaca          7300
Alejandra  Saldaña    21   Santiago          7665

In [48]:
df_clase[df_clase['Municipio']=='Apodaca']

       Apellido  Edad Municipio  Edad en dias
Nombre
Jimena    Rosas    20   Apodaca          7300

In [49]:
#ordenamiento

df_clase.sort_values("Edad")

           Apellido  Edad  Municipio  Edad en dias
Nombre
Raul       Gonzales    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

In [50]:
df_clase.sort_values("Nombre")

           Apellido  Edad  Municipio  Edad en dias
Nombre
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Juan          Perez    23  Monterrey          8395
Raul       Gonzales    17   Escobedo          6205

In [51]:
# ordenar edad de mayor a menor 

df_clase.sort_values('Edad',ascending=False)

           Apellido  Edad  Municipio  Edad en dias
Nombre
Juan          Perez    23  Monterrey          8395
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Raul       Gonzales    17   Escobedo          6205

In [52]:
df_clase.sort_values(['Edad','Apellido'])

           Apellido  Edad  Municipio  Edad en dias
Nombre
Raul       Gonzales    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

In [53]:
#numpy 

df_clase['Edad'].mean()

20.25

In [54]:
df_clase['Edad'].std(ddof=1)

2.5

In [55]:
df_clase['Edad'].sum()

81

In [58]:
import numpy as np

In [60]:
# np.where (condicion,valor si concidicion , valor no se cumple la condicion)

df_clase['Mayoria de edad']= np.where(df_clase['Edad']>=18,'Mayor de edad','Menor de edad')

In [61]:
df_clase

           Apellido  Edad  Municipio  Edad en dias Mayoria de edad
Nombre
Juan          Perez    23  Monterrey          8395   Mayor de edad
Raul       Gonzales    17   Escobedo          6205   Menor de edad
Jimena        Rosas    20    Apodaca          7300   Mayor de edad
Alejandra   Saldaña    21   Santiago          7665   Mayor de edad

## np.select

np.select(condiciones, valor condicion , valor si ninguna condicion se cumple)

In [66]:
condiciones = [df_clase['Edad']<=17 , df_clase['Edad']<23,df_clase['Edad']>=23]

valores = ['Prepa','Universidad','Trabajando']

df_clase['Situacion']= np.select(condiciones,valores,default='Missing')

In [67]:
df_clase

,Apellido,Edad,Municipio,Edad en dias,Mayoria de edad,Situacion
Nombre,,,,,,
Juan,Perez,23,Monterrey,8395,Mayor de edad,Trabajando
Raul,Gonzales,17,Escobedo,6205,Menor de edad,Prepa
Jimena,Rosas,20,Apodaca,7300,Mayor de edad,Universidad
Alejandra,Saldaña,21,Santiago,7665,Mayor de edad,Universidad

In [69]:
df_clase['Edad'].count()

4

In [71]:
df_clase.value_counts("Mayoria de edad")

Mayoria de edad
Mayor de edad    3
Menor de edad    1
Name: count, dtype: int64

In [74]:
df_clase.groupby('Mayoria de edad').mean(numeric_only=True).round(1)['Edad']

Mayoria de edad
Mayor de edad    21.3
Menor de edad    17.0
Name: Edad, dtype: float64

In [75]:
# aggregate agg 

df_clase.agg('count')

Apellido           4
Edad               4
Municipio          4
Edad en dias       4
Mayoria de edad    4
Situacion          4
dtype: int64

In [77]:
df_clase.groupby('Mayoria de edad')['Edad'].agg(['mean','std']).round(1)

                 mean  std
Mayoria de edad
Mayor de edad    21.3  1.5
Menor de edad    17.0  NaN

In [78]:
calificaiones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [80]:
calificaiones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [81]:
calificaiones.tail()

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [82]:
calificaiones.info

<bound method DataFrame.info of     Id            Nombre   Apellido  Calficación Final
0    1           ANTONIO     GARCIA                 73
1    2            MANUEL  FERNANDEZ                 19
2    3              JOSE   GONZALEZ                 38
3    4             DAVID      PEREZ                 14
4    5              JUAN      LOPEZ                 99
5    6      JOSE ANTONIO  RODRIGUEZ                 66
6    7            JAVIER    SANCHEZ                 46
7    8         JOSE LUIS      GOMEZ                 89
8    9  FRANCISCO JAVIER    JIMENEZ                 10
9   10            CARLOS       RUIZ                 62
10  11             JESUS     ALONSO                 94
11  12         ALEJANDRO  HERNANDEZ                 17
12  13            MIGUEL       DIAZ                 85
13  14       JOSE MANUEL  GUTIERREZ                 34
14  15            RAFAEL    ALVAREZ                 86
15  16      MIGUEL ANGEL     MORENO                100
16  17             PEDRO      MUÑOZ                  1
17  18             PABLO     BLANCO                 64
18  19             ANGEL        GIL                100
19  20            SERGIO    AGUIRRE                  2
20  21        JOSE MARIA       DIEZ                 29
21  22          FERNANDO    SALAZAR                 51
22  23             JORGE      RAMOS                 76
23  24              LUIS  DOMINGUEZ                 12
24  25           ALBERTO      ORTIZ                 99
25  26       JUAN CARLOS     IBAÑEZ                 43
26  27            ALVARO    RAMIREZ                 40
27  28            ADRIAN       SAEZ                  7>

In [83]:
calificaiones.shape

(28, 4)

In [84]:
calificaiones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [85]:
calificaiones= calificaiones.rename(columns={'Calficación Final': 'CalFinal'})

In [88]:
calificaiones.head()

   Id   Nombre   Apellido  CalFinal
0   1  ANTONIO     GARCIA        73
1   2   MANUEL  FERNANDEZ        19
2   3     JOSE   GONZALEZ        38
3   4    DAVID      PEREZ        14
4   5     JUAN      LOPEZ        99

In [91]:
calificaiones.loc[:,calificaiones.columns != 'Id']

              Nombre   Apellido  CalFinal
0            ANTONIO     GARCIA        73
1             MANUEL  FERNANDEZ        19
2               JOSE   GONZALEZ        38
3              DAVID      PEREZ        14
4               JUAN      LOPEZ        99
5       JOSE ANTONIO  RODRIGUEZ        66
6             JAVIER    SANCHEZ        46
7          JOSE LUIS      GOMEZ        89
8   FRANCISCO JAVIER    JIMENEZ        10
9             CARLOS       RUIZ        62
10             JESUS     ALONSO        94
11         ALEJANDRO  HERNANDEZ        17
12            MIGUEL       DIAZ        85
13       JOSE MANUEL  GUTIERREZ        34
14            RAFAEL    ALVAREZ        86
15      MIGUEL ANGEL     MORENO       100
16             PEDRO      MUÑOZ         1
17             PABLO     BLANCO        64
18             ANGEL        GIL       100
19            SERGIO    AGUIRRE         2
20        JOSE MARIA       DIEZ        29
21          FERNANDO    SALAZAR        51
22             JORGE      RAMOS        76
23              LUIS  DOMINGUEZ        12
24           ALBERTO      ORTIZ        99
25       JUAN CARLOS     IBAÑEZ        43
26            ALVARO    RAMIREZ        40
27            ADRIAN       SAEZ         7

In [95]:

calificaiones['Situacion']= np.where(calificaiones['CalFinal']>=70 , 'Aprobado','Reprobado' )

In [97]:
calificaiones.head()

   Id   Nombre   Apellido  CalFinal  Situacion
0   1  ANTONIO     GARCIA        73   Aprobado
1   2   MANUEL  FERNANDEZ        19  Reprobado
2   3     JOSE   GONZALEZ        38  Reprobado
3   4    DAVID      PEREZ        14  Reprobado
4   5     JUAN      LOPEZ        99   Aprobado

In [100]:
calificaiones.groupby('Situacion')['CalFinal'].agg('count')

Situacion
Aprobado     10
Reprobado    18
Name: CalFinal, dtype: int64

In [103]:
promedio = calificaiones.groupby('Situacion')['CalFinal'].agg('mean')
promedio

Situacion
Aprobado     90.100000
Reprobado    30.833333
Name: CalFinal, dtype: float64